//#ifndef MATHEC_H
//#define MATHEC_H

// Наличие условий здесь и макроса нужно лишь для устранения повторного
// переопределения, а то вдруг бибилиотеки которые мы используем в mathec.cpp
// уже были подключены в коде ещё до подкючения кода из mathec.h

int add (int x, int y);



/*
// #ifdef - условие "ЕСЛИ ОПРЕДЕЛЕННО"
// #ifndef - условие "ЕСЛИ НЕ ОПРЕДЕЛЕНО"
// #endif - окончание чтения стэйтмена который выполняется при выполнении
//                                                                      условия



#define - макрос для создания условных объектов для замены или проверки наличия

*/

//#endif // MATHEC_H
